---
layout: post
title: 코드스테이츠 첫 주
---

정말 정신없이 흘러간 첫 주였다. 두 번의 온라인 세션을 듣고, 아쉽게도 페어프로그래밍은 시도해보지 못했지만..
분명히 IT업계에서 일한지도 6년이 넘었고, 그래도 기획자이니 나름 개발에 대한 최소한의 이해는 있다고 생각했는데 완전히 실수였다. 
책으로 읽었을 때에는 이해한다고 생각했지만 (강의를 들었을 때에도) 막상 과제를 풀어보기 시작하니 왜이리 어려운지.
if문만 몇 번을 공부한건지 분명 바로바로 튀어나올 줄 알았는데 문제를 보고 > 답을 작성하는 과정에서 머리에 쥐가 나기 시작했다.
게다가 검색하다보면 나와는 전혀 다르게 코드를 작성한 사람들도 많았고 이래서 개발 배운다고 했을 때 다들 말렸구나 ^^ 하는 생각이 들었다.
그러니까, 어쩌면 노력만으로는 어려운 거 아닐까? 하는 무서운 의심이 들기 시작한 것이다.

심지어 지금은 거의 진입 단계인데도 이렇게 덜컥 겁을 먹으니, 앞으로 잘 해나갈 수 있을까 의구심이 드는 것도 사실이다.
하지만 뭐 이미 시작했으니 끝까지 가봐야하지 않을까? 
깃허브 블로그도 만든다 만든다 해놓고 계속 미루다가 이번 기회에 만들게 되었다.
앞으로 차곡차곡 잘 쌓아나가야겠다. 어째 마무리는 초등학교 그림일기 처럼 되었네.. 
